/*
 * Copyright (c) 2008-2009 QUALCOMM USA, INC.
 *
 * All source code in this file is licensed under the following license
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * version 2 as published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 * See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, you can find it at http://www.fsf.org
 */

#include <linux/delay.h>
#include <linux/types.h>
#include <linux/i2c.h>
#include <linux/uaccess.h>
#include <linux/miscdevice.h>
#include <media/msm_camera.h>
#include <media/msm_camera_sensor.h>
#include <mach/gpio.h>
#include <mach/camera.h>
#include <mach/msm_camio.h>
#include "mt9t013.h"
//FIH_ADQ,JOE HSU, check HW version
#include <mach/msm_iomap.h>
#include <mach/msm_smd.h>
#include <linux/wakelock.h>

/*=============================================================
	SENSOR REGISTER DEFINES
==============================================================*/
#define MT9T013_REG_MODEL_ID 		 0x0000
#define MT9T013_MODEL_ID     		 0x2600
#define REG_GROUPED_PARAMETER_HOLD   0x0104
#define GROUPED_PARAMETER_HOLD       0x0100
#define GROUPED_PARAMETER_UPDATE     0x0000
#define REG_COARSE_INT_TIME          0x3012
#define REG_VT_PIX_CLK_DIV           0x0300
#define REG_VT_SYS_CLK_DIV           0x0302
#define REG_PRE_PLL_CLK_DIV          0x0304
#define REG_PLL_MULTIPLIER           0x0306
#define REG_OP_PIX_CLK_DIV           0x0308
#define REG_OP_SYS_CLK_DIV           0x030A
#define REG_SCALE_M                  0x0404
#define REG_FRAME_LENGTH_LINES       0x300A
#define REG_LINE_LENGTH_PCK          0x300C
#define REG_X_ADDR_START             0x3004
#define REG_Y_ADDR_START             0x3002
#define REG_X_ADDR_END               0x3008
#define REG_Y_ADDR_END               0x3006
#define REG_X_OUTPUT_SIZE            0x034C
#define REG_Y_OUTPUT_SIZE            0x034E
#define REG_FINE_INT_TIME            0x3014
#define REG_ROW_SPEED                0x3016
#define MT9T013_REG_RESET_REGISTER   0x301A
#define MT9T013_RESET_REGISTER_PWON  0x10CC
#define MT9T013_RESET_REGISTER_PWOFF 0x1008 /* 0x10C8 stop streaming*/
#define REG_READ_MODE                0x3040
#define REG_GLOBAL_GAIN              0x305E
#define REG_TEST_PATTERN_MODE        0x3070
#define REG_FINE_CORRECTION          0x3010 //FIH_ADQ,JOE HSU
//FIH_ADQ ,JOE HSU
static struct wake_lock mt9t013_wake_lock;


static inline void init_suspend(void)
{
	wake_lock_init(&mt9t013_wake_lock, WAKE_LOCK_IDLE, "mt9t013");
}

static inline void deinit_suspend(void)
{
	wake_lock_destroy(&mt9t013_wake_lock);
}

static inline void prevent_suspend(void)
{
	wake_lock(&mt9t013_wake_lock);
}

static inline void allow_suspend(void)
{
	wake_unlock(&mt9t013_wake_lock);
}


struct reg_struct {
	uint16_t vt_pix_clk_div;          /*  0x0300 */
	uint16_t vt_sys_clk_div;          /*  0x0302 */
	uint16_t pre_pll_clk_div;         /*  0x0304 */
	uint16_t pll_multiplier;          /*  0x0306 */
	uint16_t op_pix_clk_div;          /*  0x0308 */
	uint16_t op_sys_clk_div;          /*  0x030A */
	uint16_t scale_m;                 /*  0x0404 */
	uint16_t row_speed;               /*  0x3016 */
	uint16_t x_addr_start;            /*  0x3004 */
	uint16_t x_addr_end;              /*  0x3008 */
	uint16_t y_addr_start;            /*  0x3002 */
	uint16_t y_addr_end;              /*  0x3006 */
	uint16_t read_mode;               /*  0x3040 */
	uint16_t x_output_size;           /*  0x034C */
	uint16_t y_output_size;           /*  0x034E */
	uint16_t line_length_pck;         /*  0x300C */
	uint16_t frame_length_lines;      /*  0x300A */
	uint16_t coarse_int_time; /*  0x3012 */
	uint16_t fine_int_time;   /*  0x3014 */
	uint16_t fine_correction; //0x3010//FIH_ADQ,JOE HSU
};

/*Micron settings from Applications for lower power consumption.*/
//FIH_ADQ,JOE HSU
//12-48
struct reg_struct mt9t013_reg_pat[2] = 
{ 
  { /*Preview 2x2 binning 22fps, pclk MHz, MCLK MHz*/
    0x08,	//8, //vt_pix_clk_div	REG=0x0300
    0x01,	//vt_sys_clk_div	REG=0x0302
    0x02,   //1, //pre_pll_clk_div	REG=0x0304 
    0x40,   //90,   //pll_multiplier	REG=0x0306   60 for 30fps preview, 40 for 20fps preview
    0x08,	//8, //op_pix_clk_div	REG=0x0308
    0x01,	//op_sys_clk_div	REG=0x030A
    16,	//scale_m	REG=0x0404
    0x0111,	//row_speed	REG=0x3016
    8,	//x_addr_start	REG=0x3004
    2053,	//x_addr_end	REG=0x3008
    8,	//y_addr_start	REG=0x3002
    1541,	//y_addr_end	REG=0x3006
    0x046C,	//read_mode	REG=0x3040
    1024,	//x_output_size	REG=0x034C
    768,	//y_output_size	REG=0x034E
    2616,	//line_length_pck	REG=0x300C
    860, //frame_length_lines	REG=0x300A
    16,	  //coarse_integration_time	REG=0x3012
